###########################################################################
#
# Generated by : Version 10.1 Build 153 11/29/2010 SJ Web Edition
#
# Project      : jop
# Revision     : jop
#
# Date         : Wed Feb 02 12:23:39 CET 2011
#
###########################################################################
 
 
# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
#
# ------------------------------------------


# Original Clock Setting Name: clk
#create_clock -period "20.000 ns" \
#             -name {clk} {clk}

# Clock in input pin
create_clock -period 20.0 [get_ports clk]
# Create generated clocks based on PLLs
derive_pll_clocks
# ---------------------------------------------

# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------
# MS: I want following constrains for the SSRAM connection
# Input:
#    maximum Tsu 2 ns
#    maximum Tho ? ns (could be 0-2, will be negative anyway)
# Output:
#    maximum Tco 3 ns
#
# Are the following constraints correct?
# I'm confused by the min/max input delay notion.

# Use FPGA-centric constraints
# Tsu 2 ns
set_max_delay -from [all_inputs] -to [all_registers] 2

# the value is -th, so a negative hold time would be positive
set_min_delay -from [all_inputs] -to [all_registers] -0.0

# -clock pll_inst|altpll_component|pll|clk[0] \
#	-max 2 [all_inputs]

# Tco 3 ns
set_max_delay -from [all_registers] -to [all_outputs] 3






#set_output_delay -clock pll_inst|altpll_component|pll|clk[0] \
#	3 [all_outputs]

# Default constraints for the input I/O path
#set_input_delay -clock pll_inst|altpll_component|pll|clk[0] \
#	-max 2 [all_inputs]
#set_input_delay -clock pll_inst|altpll_component|pll|clk[0] \
#	-min 1 [all_inputs]

# Default constraints for the output I/O path

#set_output_delay -clock pll_inst|altpll_component|pll|clk[0] \
#	3 [all_outputs]


# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------
# QSF: -name TSU_REQUIREMENT 2 ns -from  -to *
# set_max_delay 2 -from [get_ports *] -to [get_registers {*SRAM*}]
#set_input_delay -add_delay -clock clk_int -max 2 [get_ports {SRAM*}]



# ** Tco/MinTco requirements
#    -----------------------
# --------------
# --------------
# QSF: -name TCO_REQUIREMENT 3 ns -from  -to *SRAM*
#set_output_delay -add_delay -clock clk_int 3 [get_ports {*SRAM*}]
#set_max_delay 3 -to [get_ports {*SRAM*}]



# ---------------------------------------------

