###########################################################################
#
# Generated by : Version 10.1 Build 153 11/29/2010 SJ Full Version
#
# Project      : jop
# Revision     : jop
#
# Date         : Mon Jan 10 13:13:23 CET 2011
#
###########################################################################
 
 
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------


# Original Clock Setting Name: clk
create_clock -period "20.000 ns" \
             -name {clk} {clk}
# ---------------------------------------------

# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------




# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------

# Default Constraints
set_max_delay 5 -from [get_ports {*}]

# Constraints for SRAM
set_max_delay 3 -from [get_ports {ram*_d*}]


# ** Tco/MinTco requirements
#    -----------------------

# Default Constraints
set_max_delay 10 -to [get_ports {*}]

# Constraints for SRAM
set_output_delay -3 -clock { pll:pll_inst|altpll:altpll_component|_clk0 } [get_ports {ram*_a*}]
set_max_delay 3 -to [get_ports {ram*_a*}]
set_output_delay -3 -clock { pll:pll_inst|altpll:altpll_component|_clk0 } [get_ports {ram*_d*}]
set_max_delay 3 -to [get_ports {ram*_d*}]
set_output_delay -3 -clock { pll:pll_inst|altpll:altpll_component|_clk0 } [get_ports {ram*_noe}]
set_max_delay 3 -to [get_ports {ram*_noe}]
set_output_delay -3 -clock { pll:pll_inst|altpll:altpll_component|_clk0 } [get_ports {ram*_ncs}]
set_max_delay 3 -to [get_ports {ram*_ncs}]
set_output_delay -3 -clock { pll:pll_inst|altpll:altpll_component|_clk0 } [get_ports {ram*_nwe}]
set_max_delay 3 -to [get_ports {ram*_nwe}]
